In [24]:
import numpy as np
import pandas as pd

In [25]:
np.random.seed(101)
data = np.floor(np.random.normal(85, 3, (6,3)))
df = pd.DataFrame(data)
index = [('classA', 'F'), ('classA', 'M'), ('classB', 'F'), ('classB', 'M'), ('classC', 'F'), ('classC', 'M')]
df.index = pd.MultiIndex.from_tuples(index)
columns = [('Age', '20+'), ('Age', '30+'), ('Age', '40+')]
df.columns = pd.MultiIndex.from_tuples(columns)

In [26]:
data

array([[93., 86., 87.],
       [86., 86., 84.],
       [82., 86., 78.],
       [87., 86., 83.],
       [85., 82., 82.],
       [87., 85., 90.]])

In [27]:
df

           Age
           20+   30+   40+
classA F  93.0  86.0  87.0
       M  86.0  86.0  84.0
classB F  82.0  86.0  78.0
       M  87.0  86.0  83.0
classC F  85.0  82.0  82.0
       M  87.0  85.0  90.0

In [28]:
df.index.names=['class','sex']

In [29]:
df

             Age
             20+   30+   40+
class  sex
classA F    93.0  86.0  87.0
       M    86.0  86.0  84.0
classB F    82.0  86.0  78.0
       M    87.0  86.0  83.0
classC F    85.0  82.0  82.0
       M    87.0  85.0  90.0

In [33]:
df['Age']['20+']

class   sex
classA  F      93.0
        M      86.0
classB  F      82.0
        M      87.0
classC  F      85.0
        M      87.0
Name: 20+, dtype: float64

In [37]:
df.loc['classA','F']['Age']['20+']

93.0

In [38]:
df['Age','20+']

class   sex
classA  F      93.0
        M      86.0
classB  F      82.0
        M      87.0
classC  F      85.0
        M      87.0
Name: (Age, 20+), dtype: float64

In [40]:
df.loc[['classA','classC']]

             Age
             20+   30+   40+
class  sex
classA F    93.0  86.0  87.0
       M    86.0  86.0  84.0
classC F    85.0  82.0  82.0
       M    87.0  85.0  90.0

In [42]:
df

             Age
             20+   30+   40+
class  sex
classA F    93.0  86.0  87.0
       M    86.0  86.0  84.0
classB F    82.0  86.0  78.0
       M    87.0  86.0  83.0
classC F    85.0  82.0  82.0
       M    87.0  85.0  90.0

In [50]:
df.loc[['classA','classC']]

             Age
             20+   30+   40+
class  sex
classA F    93.0  86.0  87.0
       M    86.0  86.0  84.0
classC F    85.0  82.0  82.0
       M    87.0  85.0  90.0